misc/ObopayBulkApiPaymentResponse.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <ns3:CheckBalance xmlns:ns2="http://tempuri.org/" xmlns:ns3="http://www.obopay.com/xml/bulkpayment/v1"
                          xmlns:ns4="java:com.obopay.ws.bulkpayment.zain">
            <ns3:username>Blusky</ns3:username>
            <ns3:password>password</ns3:password>
            <ns3:nickname>Blusky</ns3:nickname>
        </ns3:CheckBalance>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>